from conf import GIFT_MENU_URL

MESSAGES = {
    'welcome_message': 'Приветствую! Я доктор натуропатии, клинический генетик и диетолог Хайм Лейбиман.\n'
                       ' Уже более 13 лет работаю с сахарным диабетом 1 типа.\n'
                       '🔸Создатель Диабетического конструктора питания.\n'
                       '🔸Под моим руководством создана генетическая панель сахарного диабета Хайма Лейбимана, '
                       'которую мы продолжаем улучшать.\n'
                       'Спасибо что участвуете в месяце открытых дверей!\n'
                       'Давайте познакомимся с Вами поближе. Заполните анкету и получите подарок 👇',
    'set_name': 'Как Вас зовут?',
    'who_has_diabetes': 'Кто у Вас болеет диабетом?',
    'set_diabetes_type': 'Какой тип диабета?',
    'how_long': 'Сколько лет болеете?',
    'set_medium_sugars': 'Какие в среднем сахара?',
    'how_much_insulin': 'Сколько подкалываете инсулина в сутки (короткого и базального)?',
    'what_help': 'В чем нужна помощь и поддержка сейчас?',
    'what_result': 'Какой результат вы хотите достичь в лечении сахарного диабета?',
    'set_gift': 'Выберите подарок:\n1. Примеры меню питания\n'
                '2. Первичная расшифровка генетического теста по Панели сахарного диабета Хайма Лейбимана\n'
                '3. 10 минутная консультация с доктором.',
    'menu_gift': 'Благодарим за заполнение анкеты! Примеры меню Вы можете увидеть по ссылке ниже:\n'
                 '{0}'.format(GIFT_MENU_URL),
    'share_contact': 'Напишите пожалуйста Ваш контактный номер, '
                     'ассистент доктора свяжется с Вами в течение 24 часов',
    'thanks_for_passing': 'Благодарим за заполнение анкеты! Ассистент доктора скоро свяжется с Вами.',
    'already_passed': 'Анкета уже пройдена.',
    'filter': 'Пожалуйста, не прибегайте к использованию ненормативной лексики.',
    'canceled': 'Действие отменено',
}
